OdGePoint2d.asVector
\details
Returns this point as a vector.

OdGePoint2d.op_Addition(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Addition operator for the OdGePoint2d class.
\param point [in]  Input 2D point, coordinates of which are added to the coordinates of this point.
\remarks
Returns a vector formed as a result of this point's coordinates + coordinates of the specified point.

OdGePoint2d.op_Subtraction(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Subtraction operator for the OdGePoint2d class.
\param point [in]  Input 2D point, coordinates of which are subtracted from the coordinates of this point.
\remarks
Returns a vector formed as a result of this point's coordinates - coordinates of the specified point.